#include <stdio.h>

#define MAX_SIZE 100  // Максимальный размер массива

// Функция для очистки буфера ввода
void clear();

// Функция ановки размера массива
void set_array_size();

// Функция для заполнения массива
void fill_array();

// Функция для вывода массива (значения и адреса)
void print_array();

// Функция 1: Определение максимального и минимального значения массива
void min_max();

// Функция 2: Разница между минимальным и максимальным значением в диапазоне k,m
void min_max_arr();

// Функция 3: Сумма элементов массива выше введенного значения k
void sum_value();