#include <stdio.h>

int main (void)
{
    int n, i;
    int f; // флаг простого числа (0 - простое, 1 - составное)

    printf("Введите положительное целое число или q для выхода\n");

    // Цикл для каждого числа от n до 2
    for (scanf("%d", &n) == 1; n > 1; n--)
    {
        // Проверяем, является ли текущее число n простым
        for (i = n - 1, f = 0; n > 1 && i > 1; i--)
        {
            if (n % i == 0)    // Если делится без остатка
                f = 1;         // Устанавливаем флаг - число составное
        }
        
        // Если флаг не установлен, число простое
        if (f != 1)
            printf("%d ", n);  // Выводим простое число
    }
    
    return 0;
}